```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.main["INTEGRATION_API_KEY"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "INTEGRATION_API_KEY"
      + updated_at      = (known after apply)
    }

  # module.github_api_key.github_actions_secret.main will be destroyed
  # (because github_actions_secret.main is not in configuration)
  - resource "github_actions_secret" "main" {
      - created_at      = "2025-05-22 12:46:06 +0000 UTC" -> null
      - id              = "playground.ashdavies.dev:integration_api_key" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "playground.ashdavies.dev" -> null
      - secret_name     = "integration_api_key" -> null
      - updated_at      = "2025-05-22 12:46:06 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->